In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 32],
    'City': ['New York', 'Paris', 'Berlin', 'London']
}

# converting into a table will be easier to read

## Creating DataFrame

In [6]:
df = pd.DataFrame(data)

# index is automatically added with pandas

### Filtering columns

sql:

SELECT Name
FROM df

In [7]:
df['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

### First two rows

SELECT *
FROM df
LIMIT 2;

In [ ]:
df.head(2) # head is like limit (sql)

# head's default is first 5 rows

   Name  Age      City
0  John   28  New York
1  Anna   34     Paris

In [ ]:
# object of n dimension array
# not a normal string, numpy str

In [ ]:
df.info() # info method

# tells you everything about df (summary) -> datatypes, constraints
# str is marked as object -> all strings are objects (pandas doesn't understand what str is)
# 4 entries (rows) , 3 columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 228.0+ bytes

In [ ]:
df
df.shape # (rows, columns)
# output (4 rows, 3 columns -> don't include index)

(4, 3)

In [11]:
df.dtypes # datatypes

Name    object
Age      int64
City    object
dtype: object

In [12]:
df.columns # only shows columns

Index(['Name', 'Age', 'City'], dtype='object')

In [ ]:
# Preliminary summarised info

df.describe() # for integer columns, shows all functions (count, mean, std, etc.)
# behind the scenes: np.mean(df)
# doesn't make sense to do with objects also

             Age
count   4.000000
mean   30.750000
std     2.753785
min    28.000000
25%    28.750000
50%    30.500000
75%    32.500000
max    34.000000

In [ ]:
df.describe(include="all") # Force all the columns

# top -> most repeated
# extra rows: unique, top, freq
# Age -> unique, top, freq == NaN (doesn't make sense for int)

        Name        Age      City
count      4   4.000000         4
unique     4        NaN         4
top     John        NaN  New York
freq       1        NaN         1
mean     NaN  30.750000       NaN
std      NaN   2.753785       NaN
min      NaN  28.000000       NaN
25%      NaN  28.750000       NaN
50%      NaN  30.500000       NaN
75%      NaN  32.500000       NaN
max      NaN  34.000000       NaN

## Task
1. Load CSV as dataframe
2. Get first 5 rows
3. Get a feel for the dataframe - getting a feel of the table
4. Get a feel for the data (Preliminary summarized info)

In [15]:
# Task 1: specify path to csv file

tips_df = pd.read_csv("./tips.csv")

In [17]:
tips_df # shows first and last 5 rows

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [18]:
# Task 2

tips_df.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [ ]:
# Task 3
# feel for the datafame - we want to know the structure of the dataframe

tips_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [ ]:
# Task 4
# feel for data - we want to know the summarised stats of the data

tips_df.describe()
tips_df.describe(include='all')

# top -> mode == No (mostly no smokers)

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [ ]:
# 25%, 50%, 75% -> represents percentiles (bell curve)
# mean represents the middle (average point - highest on curve)
# 75% of total bill is below 24.1275

In [22]:
tips_df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
# what holds multiple values? list

tips_df[['day', 'time', 'tip']] # filter columns

      day    time   tip
0     Sun  Dinner  1.01
1     Sun  Dinner  1.66
2     Sun  Dinner  3.50
3     Sun  Dinner  3.31
4     Sun  Dinner  3.61
..    ...     ...   ...
239   Sat  Dinner  5.92
240   Sat  Dinner  2.00
241   Sat  Dinner  2.00
242   Sat  Dinner  1.75
243  Thur  Dinner  3.00

[244 rows x 3 columns]

In [ ]:
tips_df[["day", "time", "tip"]].head(10) # filter + limit

   day    time   tip
0  Sun  Dinner  1.01
1  Sun  Dinner  1.66
2  Sun  Dinner  3.50
3  Sun  Dinner  3.31
4  Sun  Dinner  3.61
5  Sun  Dinner  4.71
6  Sun  Dinner  2.00
7  Sun  Dinner  3.12
8  Sun  Dinner  1.96
9  Sun  Dinner  3.23

## Adding a column into table

- based on the size, we want to know tip average (per person, how much are they tipping)

In [27]:
tips_df['tip'] / tips_df['size']

0      0.505000
1      0.553333
2      1.166667
3      1.655000
4      0.902500
         ...
239    1.973333
240    1.000000
241    1.000000
242    0.875000
243    1.500000
Length: 244, dtype: float64

In [ ]:
# in SQL, we use as to add a temporary column
# however we altering the table (add to exisiting)

tips_df["tips_per_person"] = tips_df["tip"] / tips_df["size"] # Adding new column

In [30]:
tips_df

     total_bill   tip     sex smoker   day    time  size  tips_per_person
0         16.99  1.01  Female     No   Sun  Dinner     2         0.505000
1         10.34  1.66    Male     No   Sun  Dinner     3         0.553333
2         21.01  3.50    Male     No   Sun  Dinner     3         1.166667
3         23.68  3.31    Male     No   Sun  Dinner     2         1.655000
4         24.59  3.61  Female     No   Sun  Dinner     4         0.902500
..          ...   ...     ...    ...   ...     ...   ...              ...
239       29.03  5.92    Male     No   Sat  Dinner     3         1.973333
240       27.18  2.00  Female    Yes   Sat  Dinner     2         1.000000
241       22.67  2.00    Male    Yes   Sat  Dinner     2         1.000000
242       17.82  1.75    Male     No   Sat  Dinner     2         0.875000
243       18.78  3.00  Female     No  Thur  Dinner     2         1.500000

[244 rows x 8 columns]

# Find the how much percentage people are tiping
 
- Find tip percentage
- Add it as another column - tip_percent
- Round off to 2 decimal
- `20.34` not be `0.243`

tip percentage -> how much they tipping compared to total bill

In [39]:
tips_df['tip_percentage'] = round((tips_df['tip'] / tips_df['total_bill']) * 100, 2)

In [40]:
tips_df

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,1.973333,20.39
240,27.18,2.00,Female,Yes,Sat,Dinner,2,1.000000,7.36
241,22.67,2.00,Male,Yes,Sat,Dinner,2,1.000000,8.82
242,17.82,1.75,Male,No,Sat,Dinner,2,0.875000,9.82
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500000,15.97

## Task 1
- Filter the rows where people dined on a Sunday
- Clue: Boolean matrix

In [43]:
tips_df[tips_df['day'] == 'Sun']

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,0.505000,5.94
1,10.34,1.66,Male,No,Sun,Dinner,3,0.553333,16.05
2,21.01,3.50,Male,No,Sun,Dinner,3,1.166667,16.66
3,23.68,3.31,Male,No,Sun,Dinner,2,1.655000,13.98
4,24.59,3.61,Female,No,Sun,Dinner,4,0.902500,14.68
...,...,...,...,...,...,...,...,...,...
186,20.90,3.50,Female,Yes,Sun,Dinner,3,1.166667,16.75
187,30.46,2.00,Male,Yes,Sun,Dinner,5,0.400000,6.57
188,18.15,3.50,Female,Yes,Sun,Dinner,3,1.166667,19.28
189,23.10,4.00,Male,Yes,Sun,Dinner,3,1.333333,17.32
190,15.69,1.50,Male,Yes,Sun,Dinner,2,0.750000,9.56

## Task 2
Get the rows where person have tipped more than R3 on a Friday

In [48]:
tips_df[tips_df['day'] == 'Fri'][tips_df['tip'] > 3]

C:\Users\E1009816\AppData\Local\Temp\ipykernel_21804\2625282539.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  tips_df[tips_df['day'] == 'Fri'][tips_df['tip'] > 3]

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
91,22.49,3.50,Male,No,Fri,Dinner,2,1.7500,15.56
93,16.32,4.30,Female,Yes,Fri,Dinner,2,2.1500,26.35
94,22.75,3.25,Female,No,Fri,Dinner,2,1.6250,14.29
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.1825,11.77
96,27.28,4.00,Male,Yes,Fri,Dinner,2,2.0000,14.66
221,13.42,3.48,Female,Yes,Fri,Lunch,2,1.7400,25.93

## Task 3
Extended task 2 top 5 tips on that Friday

In [ ]:
fri_tips = tips_df[tips_df["day"] == "Fri"][tips_df["tip"] > 3]

# tips_df.sort_values(by=fri, ascending=False)

fri_tips

C:\Users\E1009816\AppData\Local\Temp\ipykernel_21804\3700045985.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  fri_tips = tips_df[tips_df["day"] == "Fri"][tips_df["tip"] > 3]

,total_bill,tip,sex,smoker,day,time,size,tips_per_person,tip_percentage
91,22.49,3.50,Male,No,Fri,Dinner,2,1.7500,15.56
93,16.32,4.30,Female,Yes,Fri,Dinner,2,2.1500,26.35
94,22.75,3.25,Female,No,Fri,Dinner,2,1.6250,14.29
95,40.17,4.73,Male,Yes,Fri,Dinner,4,1.1825,11.77
96,27.28,4.00,Male,Yes,Fri,Dinner,2,2.0000,14.66
221,13.42,3.48,Female,Yes,Fri,Lunch,2,1.7400,25.93